<!DOCTYPE html>
<html lang="de-de"><head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel="stylesheet" href="styles.css">
   <meta name="Author" content="ACA">
   
   <meta name="KeyWords" content="didgeridoo, yedaki, bumerang">
   <title>australien, didgeridoo, bumerang, yedaki</title></head>

<body>

<h2>
Australien</h2>

<table>
<tbody><tr>
<td>Leider kenne ich Australien nur aus Reiseberichten bzw. Dokumentarfilme.
Grund genug mich mit der Kultur zu besch&auml;ftigen, auch wenn es sich
nur um Yedaki's und Bumerangs handelt. Schliesslich sollte die <a href="holz.htm"><span style="font-weight: bold;">Holz</span></a>-Bastelei
nicht zu kurz kommen !
<p>Angefangen hat das alles im Urlaub; aus der Langeweile heraus habe ich
mir zuerst einen Didgeridoo aus PVC gebastelt und danach mehrere <a href="#bumerang">Bumerangs</a>,
die tats&auml;chlich auch zur&uuml;ckkommen :)) .</p></td>

<td><img src="../images/map_nt.gif" nosave="" height="153" width="167"></td>
</tr>
</tbody></table>

<center>
<p><img src="../images/echse.jpg" nosave="" height="40" width="40"></p></center>

<h3>
Didgeridoo, Yedaki</h3>
Das sind verschiedene Benennungen f&uuml;r das gleiche Instrument. Es ist
eines der &auml;ltesten Instrumente der Erde. Die australischen Yedakis
sind urspr&uuml;nglich im Norden Australien, im Arnhemland, beheimatet.
Die Aborigines spielen diese Instrumente bei Ritualen und Festen.
<p>Die australischen Yedakis sind meistens aus Eukalyptusholz, das von
Termiten ausgeh&ouml;hlt wird. Der Baum lebt dabei normal weiter, da die
Termiten nicht bis in die Wachstumregion fressen. Die Fra&szlig;spuren
auf der Innenseite des Yedaki tragen zum Klangcharakter bei. Es gleicht
so kein Instrument dem andern.
</p><p>Im Prinzip ist das Didgeridoo ein Rohr, in welchem durch die Lippenvibration
eine stehende Welle erzeugt wird. Dieser Grundton, der haupts&auml;chlich
durch die L&auml;nge, den Durchmesser usw. des Innenraumes des Didge vorgegeben
wird, kann durch den Einsatz von Lippen, Zunge, Kehlkopf, Zwerchfell und
Stimmb&auml;ndern ver&auml;ndert werden.
</p><p><img src="../images/didg.gif" nosave="" height="44" width="500">
</p><h4>
</h4>

<h4>
Didgebau</h4>
Da es hier weder Eukalyptus noch Termiten gibt, mu&szlig; man wohl auf
andere <a href="#Holzdidgeridoos">H&ouml;lzer</a> ausweichen. Aber bevor
man das gute St&uuml;ck zum Trocknen h&auml;ngt, kann man schon mal auf
einen <b>PVC</b>-Didge &uuml;ben.
<p>Dazu verwendet man z.B. einen 40mm PP-Abwasserrohr mit 1,5m L&auml;nge
und eventuell ein Reduzierst&uuml;ck HTEM DN 70x40 f&uuml;r den besseren
Klang. Man sollte nur das gute graue PP-Rohr verwenden; bitte kein Recyclematerial.
Das hat mit der chemischen Zusammensetzung zu tun und nichts mit Umweltschutz.
Schliesslich hat man "engen" Hautkontakt zum Rohr und m&ouml;chte nicht
irgendwelche Weichmacher aufnehmen.
</p><p>Zur weiteren Bearbeitung kann man die <a href="http://www.detididge.de">Anleitung</a>
von <a href="mailto:deti@ta-deti.de">D. M&uuml;ller</a> verwenden. F&uuml;r
den Anfang sollte man das Rohr auf ca. 1,2m k&uuml;rzen (<a href="http://www.didgeridoo.net/welcome/infos/schwing/schwing.htm#Schallgeschwindigkeit">Tonlage
~ c</a>) und das eine Rohrende mit 5cm breiten Krepp umwickeln und dabei
ca. 2cm nach innen falten. So kann das (Bienenwachs-)<a href="#mundstueck">Mundst&uuml;ck</a>
besser kleben. Damit keine unkontrollierten Vibrationen auftreten, klebt
man etwa 2/3 des Rohrs mit Kreppband ab, tr&auml;gt Holzleim drauf und
wickelt Packetband stramm darum.
</p><p><img src="../images/rohr.gif" nosave="" height="60" width="563">
</p><p>Das restliche Drittel kann man mit Autospachtel bearbeiten und malen;
sieht fast aus wie ein echtes Didge... Wer es noch g&uuml;nstiger haben
will, mu&szlig; zu B&auml;renklau
greifen. Diese Pflanze ist aber giftig und verursacht Verbrennungen bei
Kontakt mit dem Pflanzensaft und Samen. D.h. Arbeitskleidung und -handschuhe
beim Zuschneiden anziehen und danach den Stamm erstmal trocknen lassen.
Der trockene Stamm ist nicht mehr giftig.
</p><p>Ansonsten eignet sich noch Bambus
zum Bau von Didgeridoos; leider neigt Bambus stark zum reissen und mu&szlig;
dementsprechend mit Wachs o.&auml;. von innen behandelt und zus&auml;tzlich
von aussen z.B. mit Packetband gewickelt werden.
</p><p>Wie beim B&auml;renklau m&uuml;ssen im Inneren des Bambus die Knoten
durchgestossen werden und mit einer an einer Verl&auml;ngerung befestigten
Feile geraspelt werden. Auch die "samtige" Schicht im Innern mu&szlig;
entfernt werden. Danach werden die Enden geraspelt und gegl&auml;ttet.
Zuletzt wird das Mundst&uuml;ck angebracht.
<br>
</p><p>Der Bau eines&nbsp;<a name="Holzdidgeridoos"></a>Holzdidgeridoos ben&ouml;tigt
die meiste Zeit und Arbeit. Grunds&auml;tzlich gibt es zwei Methoden das
gute St&uuml;ck zu bearbeiten: den Stamm durchbohren, oder der L&auml;nge
nach aufs&auml;gen und aush&ouml;hlen. Ersteres wird auf der <a href="http://www.yedaki.de">Seite</a>
von <a href="mailto:johannes@schildkamp.de">J. Schildkamp</a> ausf&uuml;hrlich
gezeigt. Die sog. "Sandwich"-Methode kann man bei Didg'n
Steve finden. Die Holzart ist nicht ganz unwichtig, da es ein Hartholz sein sollte;
n&auml;heres findet man bei <a href="http://www.didgeman.de">T.
H&ouml;pfner</a> und bei <a href="http://www.detididge.de/holz.html">D.
M&uuml;ller</a>.
</p><center>
<p><img src="../images/hahn.jpg" nosave="" height="40" width="40"></p></center>

<h4>
Das Mundst&uuml;ck<a name="mundstueck"></a></h4>
Auch hier gibt es mehrere Varianten: das Originale aus Bienenwachs, ein
Holzeinsatz oder eine Kokosnu&szlig;.
<p>Bienenwachs findet man in jedem Bastelladen, entweder als Platte oder
als Granulat. Die beste Methode ist die Erw&auml;rmung mit einem F&ouml;n,
aber nicht zu heiss, sonst verliert das Bienenwachs seine klebrige Eigenschaft.
</p><p>Man formt eine lange, etwa 2-3cm dicke Wurst und formt diese zum Ring.
Dieser Ring wird auf das Rohr gelegt und festgeknetet. Den Durchmesser
mu&szlig; man auf eigene Bed&uuml;rfnisse anpassen. Die Innenkante sollte
ca. 90 Grad betragen.
<br>
</p><p>F&uuml;r den Bau eines <a href="http://www.didgeman.de">Holzeinsatzes</a>
ben&ouml;tigt man schon etwas mehr Werkzeug. F&uuml;r Barttr&auml;ger auch
sehr geeignet ist eine Kokosnu&szlig;; auch hier ist die Anleitung von
<a href="http://www.detididge.de">D.
M&uuml;ller</a> zu folgen. F&uuml;r seine Bauanleitung ben&ouml;tigt man
noch eine Flasche Rum und Eisw&uuml;rfel *-)) .
</p><p>Ich komme noch ohne aus, da ich Kokos nicht besonders mag. Zuerst zwei
L&ouml;cher bohren, den Saft rauslassen und die Kokos der L&auml;nge nach
durchs&auml;gen. Man kann diese sogar dritteln und daraus drei Mundst&uuml;cke
basteln. Hier wird ein Lochs&auml;geset ben&ouml;tigt; aber vorsicht bei
Billigware. Die S&auml;gebl&auml;tter m&uuml;ssen <u>stramm</u> festsitzen,
sonst kriegt man damit keinen sauberen Schnitt hin. Und dicke Leder-Arbeitshandschuhe
tragen...
</p><p>Da ich oft mit Holz arbeite, habe ich da schon qualitativ etwas besseres
Werkzeug. Es lohnt sich! Je nach Rohrdurchmesser wird zuerst die &auml;u&szlig;ere
Nut so tief anges&auml;gt, so da&szlig; sp&auml;ter das S&auml;geblatt
keine F&uuml;hrung mehr braucht. Bei 40-Rohr nimmt man f&uuml;r den &auml;u&szlig;eren
Schnitt etwa 45mm S&auml;geblatt, f&uuml;r den inneren f&auml;ngt man bei
30mm an. Der Innenring wird einfach durchges&auml;gt und mit 80-Schleifpapier
entfernen wir das Gr&ouml;bste der Kokosnu&szlig;schale. Danach mu&szlig;
man den Aussenring s&auml;gen. Sp&auml;testens hier wird man sich &uuml;ber
die Billigware &auml;rgern...
</p><p>Danach wird das Mundst&uuml;ck am Rohr angepasst und mit Bienenwachs
oder Heissklebepistole angeklebt. Die zweite Methode ist nat&uuml;rlich
leichter, vor allem weil man das Mundst&uuml;ck mit einer Halbrundfeile
nachbearbeiten mu&szlig; und dieser Kleber h&auml;lt zumindestens bombig.
Als letztes kann man das Mundst&uuml;ck mit 400/1000-Schleifpapier polieren
und den &Uuml;bergang zum Rohr mit Bienenwachs verkleiden.
</p><center>
<p><img src="../images/schkroete.jpg" nosave="" height="40" width="40"></p></center>

<h4>
Der Grundton:</h4>
Mach einen Schmollmund, st&uuml;lpe die Lippen nach vorne und achte darauf,
da&szlig; die Lippen entspannt sind. Blase die Luft aus dem Mund heraus.
Das Ger&auml;usch, das dabei entsteht &auml;hnelt einem "Furz". Setze das
Instrument am Mund und achte darauf, da&szlig; keine L&uuml;cke zwischen
Mund und Instrument ist!
<br>Blase in das Instrument. Die Qualit&auml;t des Tons h&auml;ngt nicht
von der Kraft ab, mit der man hineinbl&auml;st, sondern von der Kontrolle
der Lippenspannung. Springt das Didgeridoo an, f&auml;ngt es an zu vibrieren
und der Grundton ist erstmals zu h&ouml;ren.
<center>
<p><img src="../images/mensch.jpg" nosave="" height="36" width="38"></p></center>

<h4>
Zirkulationsatmung:</h4>
Atme kurz und kr&auml;ftig durch die Nase ein. Blase die Wangen auf, presse
die Luft heraus und mach das klassische "Pupsger&auml;usch". Atme nun gleichzeitig
kurz und kr&auml;ftig durch die Nase ein und presse die Luft aus dem Mund.
Falls man diese ganz wichtige Atemkoordination so nicht hinbekommst, macht
man es wie die Aborigines: F&uuml;lle den Mund mit Wasser, spucke es aus
und atme dabei durch die Nase ein. Das ganze nun wieder mit Luft. Erzeuge
jetzt einen Ton mit dem Didgeridoo, indem Du die Luft aus Deinen vollen
Wangen presst.&nbsp; Erweitere diese Technik, indem Du beim Herauspressen
der Luft kurz und kr&auml;ftig Luft durch die Nase einatmest. Geduld, diese
Technik mu&szlig; erstmal gelernt werden.
<br>&nbsp;
<center>
<p><img src="../images/kango.gif" nosave="" height="57" width="59"></p></center>

<h3>
Bumerang<a name="bumerang"></a></h3>
Nach geschichtlichen &Uuml;berlieferungen gabs den Bumerang nicht nur in
Australien, sondern auch auf den anderen Kontinenten. In Australien wurde
dieser angeblich dazu verwendet V&ouml;gel von den Felder zu verscheuchen.
Daher leuchtet es vielleicht auch ein warum diese auch <b>zur&uuml;ckfliegen</b>
sollten.
<p>Es gibt auch sog. Jagdbumerangs, auch Nichtr&uuml;ckkehrer genannt.
Diese fliegen nicht zur&uuml;ck, sondern sind schwere Einwegflieger, die
die Beute m&ouml;glichst bewu&szlig;tlos bzw. erschlagen sollen.
</p><center>
<p><img src="../images/tri.jpg" nosave="" height="40" width="43"></p></center>

<h4>
Bauanleitungen</h4>
Moderne Bumerangs werden aus mehrschichtigen fin. Birken-Flugzeugsperrholz
und Kunststoff gebaut. Ich selbst habe nur Holzbumerangs gebaut. Als erstes
ben&ouml;tigt man eine Vorlage, die entsprechend vergr&ouml;&szlig;ert
werden mu&szlig;, um aufs Holz gezeichnet zu werden. Hier ist zu beachten,
da&szlig; es Bumerangs f&uuml;r Links- und Rechtsh&auml;nder gibt. Der
Schliff ist dann genau umgekehrt anzubringen.
<p>Die Maserung sollte aufgrund besserer Bruchfestigkeit von einem Fl&uuml;gelende
zum anderen verlaufen. Diese werden dann ausges&auml;gt und mit einer Holzfeile
weiterbearbeitet. Der Schliff ist nicht ganz unwichtig, da hier die Flugeigenschaften
ma&szlig;geblich ver&auml;ndert werden k&ouml;nnen. Feintuning erfolgt
mit zus&auml;tzlichen Bleigewichten etc.
</p><p>Hier einige meiner Nachbauten in 6mm; diese und viele andere Baupl&auml;ne
sind auf der <a href="http://www.bumerangs.de">Bumerang-Seite</a> zu finden.
<br>
<br>
<br>
<table>
<tbody><tr>
<td><img src="../images/standard.gif" nosave="" height="150" width="228"></td>

<td><img src="../images/albatros.gif" nosave="" height="150" width="225"></td>

<td><img src="../images/ikarus.gif" nosave="" height="170" width="164"></td>
</tr>
</tbody></table>
<font size="-1">(Bauplaene k&ouml;nnen mit rechter Maustaste/<i>Grafik anzeigen</i>
vergroessert werden)</font>

</p><h4>
Wurfanleitung</h4>
Bei Zweifl&uuml;glern wird i.A. der Arm 2 genommen. Von entscheidender
Bedeutung ist der richtige Griff. Der Bumerang darf nicht mit der ganzen
Hand umklammert werden. Bei leichten Modellen ist es empfehlenswert, den
Bumerang nur zwischen Daumen und Zeigefinger einzuklemmen. Au&szlig;erdem
ist darauf zu achten, da&szlig; die stark gew&ouml;lbte Oberseite zum K&ouml;rper
zeigt.
<p>Ein verbreiteter Anf&auml;nger-Fehler ist es, den Bumerang waagerecht
zu werfen. Der Bumerang mu&szlig; fast senkrecht, nur leicht geneigt, geworfen
werden. Wie stark die Neigung sein mu&szlig;, h&auml;ngt vom Modell ab.
Gro&szlig;e Formen und&nbsp; Weitwurfbumerangs ben&ouml;tigen relativ viel
Neigungswinkel. Ist der Neigungswinkel zu gro&szlig;, fliegt der Bumerang
sehr hoch und st&uuml;rzt ab.
</p><p>Bei Windstille ist es egal, in welche Richtung man wirft. Beim leisesten
L&uuml;ftchen ist die Richtung (der sogenannte "Luvwinkel") dagegen sehr
wichtig. Landet der Bumerang vor einem, mu&szlig; man mehr in den Wind
werfen, landet er hinter einem, wirft man mehr aus dem Wind heraus. Ab
3-4 Windst&auml;rken sollte man den Bumerang &uuml;brigens besser zu Hause
lassen.
</p><p>Fast alle Bumerangs m&uuml;ssen parallel zum Boden oder leicht aufw&auml;rts
geworfen werden (ca. 5&deg;). Der Bewegungsablauf ist dem beim Werfen eines
Balls &auml;hnlich. Nur mu&szlig; dem Bumerang zus&auml;tzlich durch Bewegung
des Handgelenks m&ouml;glichst viel Rotation mitgegeben werden. F&auml;llt
der Bumerang auf halbem Weg zu Boden, hat der "Spin" nicht ausgereicht.
Beim Ausholen sollte das Handgelenk nach hinten gekippt werden. Unmittelbar
vor dem Loslassen schnappt dann das Handgelenk nach vorne. Die Hand sollte
dabei eher &uuml;ber die Schulter als an der Schulter vorbei gef&uuml;hrt
werden.

</p><h4>
Flugfehler</h4>
<i>M&ouml;gliche Abwurffehler:</i>
<br><b>Kreis zu fr&uuml;h beendet bzw. Bumerang landet links vom Werfer</b>
<p>F&uuml;nf m&ouml;gliche Abwurffehler:
<br>1. Zu geringe Abwurfkraft
<br>2. Luvwinkel zu klein
<br>3. Neigungswinkel zu klein
<br>4. Aufstiegswinkel zu klein
<br>5. Zu geringer Spin
</p><p><b>Bumerang fliegt zu hoch an der Position des Werfers vorbei</b>
</p><p>Drei m&ouml;gliche Abwurffehler:
<br>1. Abwurfkraft zu gro&szlig;
<br>2. Neigungswinkel zu gro&szlig;
<br>3. Aufstiegswinkel zu gro&szlig;
<br>
<br><b>Bumerang landet rechts vom Werfer</b>
</p><p>1. Luvwinkel zu gro&szlig;
<br>
<br>
<br>
</p><center>
<p><img src="../images/uluru.jpg" nosave="" height="212" width="345"></p></center>

</body></html>