<!DOCTYPE html>
<html lang="de-de"><head>

  <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
  <meta name="keywords" content="Bergwandern, Alpen">
<link rel="stylesheet" href="../assets/css/styles.css">
  <title>Wanderungen in den Alpen</title></head>

<body bgcolor="#ffffff">

<br>
Seit meinem Umzug in den S&uuml;den, habe ich es nat&uuml;rlich nicht weit bis zu den Alpen. Die ersten Gehversuche habe ich in den Berchtesgadener
Alpen unternommen und war begeistert. Seitdem sind wir &uuml;ber Umwege im Allg&auml;u gelandet.

<p>Anbei einige bebilderte <a href="touren.htm"><big><span style="font-weight: bold;">Touren</span></big></a><big><span style="font-weight: bold;"> </span></big><small>,</small> die u.a. in bekannten Wanderf&uuml;hrern n&auml;her beschrieben werden. Dort werden die Anforderungen der Touren in <span style="color: rgb(0, 0, 153); font-weight: bold;">BLAU</span><span style="font-weight: bold;">,</span> <span style="color: rgb(255, 0, 0); font-weight: bold;">ROT</span>
und <span style="font-weight: bold;">SCHWARZ</span> unterteilt. Damit wird der Anspruch wie&nbsp;Ausdauer, Trittsicherheit, etc. wiedergegeben. Blau markierte Touren d&uuml;rfen
durchaus von/mit&nbsp; Kindern begangen werden. Rote Touren sind anspruchsvoller und verlangen z.T. Trittsicherheit und
Schwindelfreiheit. Schwarze Touren sind was f&uuml;r erfahrene Bergwanderer und sollten keinesfalls untersch&auml;tzt werden.</p>
<p>Hilfreich bei alpinen Wanderungen ist das Klettern in der Halle; man f&uuml;hlt sich dadurch draussen am Felsen einfach sicherer und wendet
instinktiv die gelernte Griff- und Fusstechnik an.&nbsp;</p>

<p>Kurz einige W&ouml;rter zur <big>Ausr&uuml;stung</big>: Wanderungen erfordern vor allem gute Wanderstiefel; Stiefel weil diese mehr Halt
geben und vor etwaige Kn&ouml;chelverletzungen sch&uuml;tzen. Hier zu sparen w&auml;re der falsche Weg. Je nach Tour sollte man seine
Ausr&uuml;stung entsprechend ausw&auml;hlen.&nbsp;</p>

<p>Die&nbsp;Liste ist nur eine kleine Aufz&auml;hlung, die z.B. um Extras wie Klettersteig-Set, Gr&ouml;deln, Pickel, Biwak erweitert
werden kann. Digicam und Karte ist auch nicht verkehrt, sowie allg. Hygiene-Utensilien f&uuml;r die pers&ouml;nliche Pflege (bei mehrt&auml;tigen Touren).</p>

<ul>
  <li>Tourenrucksack (Daypack ca. 30 l oder etwas gr&ouml;sser bis 50 l)</li>
  <li>Wanderst&ouml;cke</li>
  <li>Trinkflasche f&uuml;r 1 - 2 l&nbsp; (und Proviant)</li>
  <li>H&uuml;ttenschlafsack</li>
  <li>Freizeitschuhe, ggf. H&uuml;ttenschuhe</li>
  <li>Wanderhose (Beine abzippbar), Trainings-/Freizeithose</li>
  <li>"Gute" Wandersocken</li>
  <li>Unterw&auml;sche (ideal: Funktionsw&auml;sche)</li>
  <li>T- oder Funktionsshirts</li>
  <li>Fleecejacke/-pullover</li>
  <li>Regenhose, -jacke, Gamaschen&nbsp;</li>
  <li>Sonnenschutz: Kopfschutz, Sonnenbrille, -creme</li>
  <li>M&uuml;tze, Handschuhe</li>
  <li>Taschenmesser, -lampe und Erste-Hilfe-Set</li>
</ul>
<br>
  <p>Hier soll die Tage die Packliste fuers Biken folgen...</p>

<p><br>
<a href="http://www.alpenverein.de"><img src="../images/davmain.gif" alt="alpenverein" nosave="" border="0" height="50" width="85"></a>
</p>

<p><a href="../index1.htm"><img src="../images/A_up.gif" alt="back" nosave="" border="0" height="20" width="20"></a>
<br>
<br>
</p>
</body></html>
